       IDENTIFICATION DIVISION.
       PROGRAM-ID. FILEHANDLERSTEST.
       
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       
       COPY "FILEHANDLER".
       
       PROCEDURE DIVISION.
       DISPLAY "TESTING FILE HANDLER".

       SET F-OPEN TO TRUE
       SET READ-MODE TO TRUE

       CALL PGM-NAME IN FILEHANDLER USING FILEHANDLER


       