       IDENTIFICATION DIVISION.
       PROGRAM-ID. FILEHANDLER.
       
       ENVIRONMENT DIVISION.
       
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       
       DATA DIVISION.
       
       WORKING-STORAGE SECTION.
       
       COPY "FILEHANDLER.cpy".
       
       LINKAGE SECTION.
       

       PROCEDURE DIVISION.
       